public class HelloWorld {
    public static void main(String[] args) {


        // Треугольник существует только тогда, когда сумма любых двух его сторон больше третьей.
        // Определить существует ли такой треугольник. Дано: a, b, c – стороны предполагаемого треугольника.
        // Требуется сравнить длину каждого отрезка-стороны с суммой двух других. Если хотя бы в одном случае
        // отрезок окажется больше суммы двух других, то треугольника с такими сторонами не существует.

        int a = 10;
        int b = 10;
        int c = 6;



//        boolean v = 7 != 0;
//        System.out.println(v);
    }
}
